РезервированиеТоваров/Documents/СчетНаОплатуПокупателю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>СчетНаОплатуПокупателю</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РЗ_ЗарезервированныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.РЗ_ПотребностьВТоварах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РезервированиеТоваров/AccumulationRegisters/РЗ_ПотребностьВТоварах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РЗ_ПотребностьВТоварах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетПокупателю</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

РезервированиеТоваров/AccumulationRegisters/РЗ_ЗарезервированныеТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РЗ_ЗарезервированныеТовары</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетПокупателю</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

РезервированиеТоваров/InformationRegisters/РЗ_СведенияОРезервированииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>РЗ_СведенияОРезервированииТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Отражена необходимость резервирования (если пустое значение, для всего документа)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

РезервированиеТоваров/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

РезервированиеТоваров/Documents/СчетНаОплатуПокупателю/Ext/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура РЗ_ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.РЗ_ПотребностьВТоварах.Записывать = Истина;
	Движения.РЗ_ЗарезервированныеТовары.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РЗ_СведенияОРезервированииТоваров.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.РЗ_СведенияОРезервированииТоваров КАК РЗ_СведенияОРезервированииТоваров
	|ГДЕ
	|	РЗ_СведенияОРезервированииТоваров.Документ = &Ссылка";
	
	Результат = Запрос.Выполнить();

	Если Не Результат.Пустой() Тогда
		ТаблицаТоваровДокумента = Товары.Выгрузить(, "Номенклатура,Количество");
		ТаблицаТоваровДокумента.Свернуть("Номенклатура", "Количество");
		Для каждого ТекСтрока Из ТаблицаТоваровДокумента Цикл
			Движение = Движения.РЗ_ПотребностьВТоварах.Добавить();
			Движение.Период           = Дата;
			Движение.ВидДвижения      = ВидДвиженияНакопления.Приход;
			Движение.Номенклатура     = ТекСтрока.Номенклатура;
			Движение.Количество       = ТекСтрока.Количество;
			Движение.СчетПокупателю   = Ссылка;
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", КонецДня(Дата));
	Запрос.УстановитьПараметр("ВидыСубконто", ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура"));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетаОстатковТоваров", ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ТоварыНаСкладах"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура,
	|	СчетНаОплатуПокупателюТовары.Ссылка.Ссылка КАК СчетПокупателю,
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстатокДт, 0) - ЕСТЬNULL(РЗ_ЗарезервированныеТоварыОстатки.КоличествоОстаток, 0)) КАК ДоступноДляРезервирования,
	|	СУММА(СчетНаОплатуПокупателюТовары.Количество) КАК КоличествоВСчете
	|ИЗ
	|	Документ.СчетНаОплатуПокупателю.Товары КАК СчетНаОплатуПокупателюТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РЗ_ЗарезервированныеТовары.Остатки(&Период, ) КАК РЗ_ЗарезервированныеТоварыОстатки
	|		ПО СчетНаОплатуПокупателюТовары.Номенклатура = РЗ_ЗарезервированныеТоварыОстатки.Номенклатура
	|			И СчетНаОплатуПокупателюТовары.Ссылка <> РЗ_ЗарезервированныеТоварыОстатки.СчетПокупателю
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В ИЕРАРХИИ (&СчетаОстатковТоваров), &ВидыСубконто, Организация = &Организация) КАК ХозрасчетныйОстатки
	|		ПО СчетНаОплатуПокупателюТовары.Номенклатура = ХозрасчетныйОстатки.Субконто1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РЗ_СведенияОРезервированииТоваров КАК РЗ_СведенияОРезервированииТоваров
	|		ПО СчетНаОплатуПокупателюТовары.Номенклатура = РЗ_СведенияОРезервированииТоваров.Номенклатура
	|			И (РЗ_СведенияОРезервированииТоваров.Документ = &Ссылка)
	|ГДЕ
	|	СчетНаОплатуПокупателюТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетНаОплатуПокупателюТовары.Номенклатура,
	|	СчетНаОплатуПокупателюТовары.Ссылка.Ссылка
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстатокДт, 0) - ЕСТЬNULL(РЗ_ЗарезервированныеТоварыОстатки.КоличествоОстаток, 0)) > 0";
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	
	Для каждого ТекСтрокаТовара Из ТаблицаТоваров Цикл
		Движение = Движения.РЗ_ЗарезервированныеТовары.Добавить();
		Движение.Период = Дата;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаТовара);
		Движение.Количество = Мин(ТекСтрокаТовара.КоличествоВСчете, ТекСтрокаТовара.ДоступноДляРезервирования);
	КонецЦикла;
	
КонецПроцедуры


&После("ПриЗаписи")
Процедура РЗ_ПриЗаписи(Отказ)
	
	Если Не Проведен Тогда
		Движения.РЗ_ПотребностьВТоварах.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры
